#include <iostream>
#include <vector>
#include <string>
using namespace std;

//int main() {
	//int a = 11;
	//int b = 3;
	//cout << a / b;
	//
	//return 0;
	//}
// Получили целое число, т.к. каждый из аргументов  типа int 

//int main() {
	//int a = 11;
	//double b = 3;
	//cout << a / b;
	//return 0;
//}
// Получили дробное число 3.6667 т.к. один из аргументов имеет тип double

//int main() {
//	int c = 5;
//int a = c++;
//	int b = ++c;
//	cout << "a = " << a << endl;
//	cout << "b = " << b << endl;
//	return 0;
//}
// Получаем a = 5, поскольку a копирует значение c, а сама переменная c увеличивается до 6
// Таким образом получаем, что переменная b становится равной 7. 
// В данном случае стоит воспринимать c как динамическую часть, которая все время меняется.